In [83]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 24.2
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [84]:
import pandas as pd

In [85]:
S_us = pd.read_csv('/Users/zahranazemian/Desktop/Python/state_us.csv')
S_us.head()

        State Abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [86]:
S_us.tail()

            State Abbreviation
46       Virginia           VA
47     Washington           WA
48  West Virginia           WV
49      Wisconsin           WI
50        Wyoming           WY

In [87]:
# How to print specific lines with iloc
print(S_us.iloc[2:13])

                   State Abbreviation
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID

In [91]:
# Step 1: Create a new column for the population data
S_us['Population'] = ''  # Adding an empty column

# Step 2: Assign the population data (as strings with commas)
population_data = [
    '5,024,279', '733,391', '7,151,502', '3,011,524', '39,538,223', '5,773,714', '3,605,944', '989,948', 
    '21,538,187', '10,711,908', '1,455,271', '1,839,106', '12,812,508', '6,785,528', '3,190,369', 
    '2,937,880', '4,505,836', '4,657,757', '1,362,359', '6,177,224', '7,029,917', '10,077,331', 
    '5,706,494', '2,961,279', '6,154,913', '1,084,225', '1,961,504', '3,104,614', '1,377,529', 
    '9,288,994', '2,117,522', '20,201,249', '10,439,388', '779,094', '11,799,448', '3,959,353', 
    '4,237,256', '13,002,700', '1,097,379', '5,118,425', '886,667', '6,910,840', '29,145,505', 
    '3,271,616', '643,077', '8,631,393', '7,705,281', '1,793,716', '5,893,718', '576,851', '609,203'
]

# Step 3: Assign the population values to rows 0 to 49
S_us.loc[0:50, 'Population'] = population_data

# Step 4: Save the updated DataFrame to a new CSV file
S_us.to_csv('/Users/zahranazemian/Desktop/Python/state_us_updated1.csv', index=False)

# Step 5: Read the newly saved CSV file
S_us2 = pd.read_csv('/Users/zahranazemian/Desktop/Python/state_us_updated1.csv')

# Step 6: Display the first few rows to check
S_us2.head()

        State Abbreviation  Population
0     Alabama           AL   5,024,279
1      Alaska           AK     733,391
2     Arizona           AZ   7,151,502
3    Arkansas           AR   3,011,524
4  California           CA  39,538,223

In [92]:
S_us2.tail()

            State Abbreviation Population
46       Virginia           VA  7,705,281
47     Washington           WA  1,793,716
48  West Virginia           WV  5,893,718
49      Wisconsin           WI    576,851
50        Wyoming           WY    609,203